# ClipPlane Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClipPlane Properties
ClipPlane Class See Also
---
The ClipPlane type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Normal | The plane's normal vector. |
| Origin | The plane's origin. |

# See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace